app/Controllers/Session.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
UPDATE `users` SET `username` = 'admin', `email` = 'admin@localhost.com', `password` = '$2y$10$DcxA/sWaBm63ufHh/MdzIer8YsVTT2zR6i7m9m0tLI9xcbbWItMxu', `remember_token` = 'b3e61f4d86fa60084093847a725e31a489602ee835f12f3015645c2f9738771f', `sId` = '34npeuk5b4bstmsgvg4oc09robg1p3ut', `verification_code` = 'aNzck7kR', `status` = '1', `super` = '1', `created_at` = '2023-06-14 14:23:36'
WHERE `users`.`id` IN ('1')
---
    public function loggining(){
        if($this->login_model->isLoggedIn())
            return redirect()->to('/');

        $singin = $this->request->getPost();

        if(filter_var($singin['login_input'], FILTER_VALIDATE_EMAIL))
            $user = $this->users_model->getWhere(['email' => $singin['login_input']], true);
        else
            $user = $this->users_model->getWhere(['username' => $singin['login_input']], true);
        if($user){
            if($user['status'] != "1"){
                $this->session->setFlashdata('login_error', 'Your account is currently banned.');
                return redirect()->to('login');
            }
            if(password_verify($singin['password'], $user['password'])) {
                if (isset($singin['rememberMe']) && $singin['rememberMe'] === 'on') {
                    $rememberToken = bin2hex(random_bytes(32));
                    $user['remember_token'] = $rememberToken;
                    $this->users_model->save($user);