app/Controllers/User.php

    public function manage(){
        $results = $this->users_model->getWhere(['id' => session('userdata')['user']['id']]);
---
SELECT *
FROM `users`
WHERE `id` = '1'