app/Models/LoginModel.php

	public function isLoggedIn(){

		$userdata = $this->session->get('userdata');
		if($userdata && $userdata['logged_in'] == TRUE){
			$user = $this->find($userdata['user']['id']);
			//dd(!$user['sId'] == session_id());
			if(!$user['sId'] == session_id()){
				$this->update($user['id'], ['sId' => '']);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'
UPDATE `users` SET `sId` = ''
WHERE `users`.`id` IN ('1')