app/Models/UsersModel.php

    public function getByEmail($email){
        $user = $this->where(['email' => $email])->first();
---
SELECT *
FROM `users`
WHERE `email` = 'admin@localhost.com'
 LIMIT 1